Конфигурация/src/BusinessProcesses/ОбработкаОбращенияСтудента/ОбработкаОбращенияСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ОбработкаОбращенияСтудента</name>
  <task>Task.ЗадачаПользователя</task>
  <attributes>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.ОбращениеСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Конфигурация/src/Enums/СтатусыОбращения/СтатусыОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбращения</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/BusinessProcesses/ОбработкаОбращенияСтудента/ObjectModule.bsl
Процедура ПодготовитьОтветПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Подготовить ответ на обращение студента";
		ФормируемаяЗадача.ОписаниеЗадачи = "Подготовить ответ на обращение студента";

		Если ЗначениеЗаполнено(Обращение) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Подготовить ответ на обращение студента: " + Строка(Обращение);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура РассмотретьОбращениеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Рассмотреть обращение студента";
		ФормируемаяЗадача.ОписаниеЗадачи = "Рассмотреть обращение студента";

		Если ЗначениеЗаполнено(Обращение) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Рассмотреть обращение студента: " + Строка(Обращение);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьОтветПриВыполнении(ТочкаМаршрута, Задача, Отказ)
		
	Если НЕ ЗначениеЗаполнено(Обращение) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		ОбращениеОбъект = Обращение.ПолучитьОбъект();

		ОбращениеОбъект.Статус = Перечисления.СтатусыОбращения.Выполнено;

		Если НЕ ПустаяСтрока(СокрЛП(Строка(Задача.КомментарийИсполнителя))) Тогда
			ОбращениеОбъект.Ответ = Задача.КомментарийИсполнителя;
		КонецЕсли;

		ОбращениеОбъект.Записать();

		Завершено = Истина;

	Исключение

		Сообщить("Не удалось завершить обработку обращения: " + ОписаниеОшибки());
		Отказ = Истина;

	КонецПопытки;
	
КонецПроцедуры

Процедура РассмотретьОбращениеПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	
	Если НЕ ЗначениеЗаполнено(Обращение) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		ОбращениеОбъект = Обращение.ПолучитьОбъект();

		ОбращениеОбъект.Статус = Перечисления.СтатусыОбращения.ВРаботе;
		ОбращениеОбъект.Записать();

	Исключение

		Сообщить("Не удалось изменить статус обращения: " + ОписаниеОшибки());
		Отказ = Истина;

	КонецПопытки;
	
КонецПроцедуры

Процедура ПодготовитьОтветПередСозданиемЗадач(ТочкаМаршрута, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	
КонецПроцедуры

Процедура РассмотретьОбращениеПередСозданиемЗадач(ТочкаМаршрута, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	
КонецПроцедуры
